Repository: seisoo/AppWatchdog
Catalog: AppWatchdog.UI.WPF/Localization/AppStrings.*.resx
Languages: de

source: Abort
de: Abbrechen

source: About
de: Über

# about_external_assets
source: Images & external assets
de: Bildmaterial & externe Assets

# about_external_resources_title
source: External libraries & resources:
de: Externe Bibliotheken & Ressourcen:

# about_feature_mail_text
source: Status changes and errors can be sent via email to stay informed even without an active user interface.
de: Statusänderungen und Fehler können per E-Mail versendet werden, um auch ohne aktive Benutzeroberfläche informiert zu bleiben.

# about_feature_mail_title
source: • Email notifications
de: • E-Mail-Benachrichtigungen

# about_feature_ntfy_text
source: ntfy allows sending push notifications to mobile devices or other clients to immediately inform about relevant events.
de: Über ntfy lassen sich Push-Nachrichten an mobile Geräte oder andere Clients senden, die sofort über relevante Ereignisse informieren.

# about_feature_ntfy_title
source: • ntfy (push notifications)
de: • ntfy (Push-Benachrichtigungen)

# about_feature_uptime_text
source: Integration with Uptime Kuma allows embedding into existing monitoring dashboards and centralized monitoring of multiple systems.
de: Die Anbindung an Uptime Kuma ermöglicht die Einbindung in bestehende Monitoring-Dashboards und die zentrale Überwachung mehrerer Systeme.

# about_section_contact_title
source: Contact
de: Kontakt

# about_section_service_title
source: Windows service
de: Windows-Dienst

# about_service_description_1
source: The actual monitoring is performed by a standalone Windows service that runs independently of the user interface in the background and regularly checks the status of the configured applications.
de: Die eigentliche Überwachung erfolgt durch einen eigenständigen Windows-Dienst, der unabhängig von der Benutzeroberfläche im Hintergrund arbeitet und den Zustand der konfigurierten Anwendungen regelmäßig überprüft.

# about_service_description_2
source: In addition to local status tracking, the service can actively report events. Various notification options are available for status changes or errors.
de: Neben der lokalen Statuserfassung kann der Dienst Ereignisse aktiv melden. Bei Zustandsänderungen oder Fehlern stehen verschiedene Benachrichtigungsmöglichkeiten zur Verfügung.

# about_version_label
source: Application version:
de: Programmversion:

# apps_add
source: New
de: Neu

# apps_arguments
source: Arguments (e.g. --version)
de: Argumente (z. B. --Version)

# apps_check_interval
source: Check interval (seconds)
de: Prüfintervall (Sekunden)

# apps_edit_job_description
source: Please enter a new name for the watch job of this application.
de: Bitte gib einen neuen Namen für den Watch-Job dieser Anwendung ein.

# apps_edit_job_hint
source: This name helps to identify the job in the global list.
de: Dieser Name hilft bei der Identifizierung aus der globalen Liste.

# apps_edit_job_placeholder
source: Job name
de: Name des Jobs

# apps_edit_job_title
source: Edit job name
de: Jobnamen ändern

# apps_exe_path
source: Path to EXE
de: Pfad zur EXE

# apps_general_monitoring
source: General monitoring
de: Allgemeine Überwachung

# apps_hint_text
source: Here, the applications monitored by the watchdog are configured.
de: Hier werden die vom Watchdog überwachten Anwendungen konfiguriert.

# apps_kuma_base_url
source: Base URL (e.g. https://url.com)
de: Base URL (z. B. https://url.com)

# apps_kuma_enable
source: Enable Uptime Kuma
de: Uptime Kuma-Uptime aktivieren

# apps_kuma_interval
source: Ping interval (seconds)
de: Ping-Intervall (Sekunden)

# apps_mail_interval
source: Mail interval (hours)
de: Mail-Intervall (Stunden)

# apps_monitoring_enable
source: Enable monitoring
de: Überwachung aktivieren

# apps_monitoring_title
source: Monitoring
de: Überwachung

# apps_new_application
source: New application
de: Neue Anwendung

# apps_reload
source: Reload
de: Neu laden

# apps_remove
source: Delete
de: Löschen

# apps_remove_application
source: Remove application
de: Anwendung entfernen

# apps_remove_question
source: Do you really want to delete the Watch-Job "{0}"?
de: Möchtest du den Watch-Job „{0}“ wirklich löschen?

# apps_rename_hint
source: Double click to rename job.
de: Doppelklick um Job-Bezeichnung zu ändern.

# apps_select_exe
source: Select EXE
de: EXE auswählen

# apps_select_executable
source: Select executable
de: Executable auswählen

# apps_select_file_filter
source: Executable (*.exe)|*.exe|All files (*.*)|*.*
de: Executable (*.exe)|*.exe|Alle Dateien (*.*)|*.*

# apps_settings_title
source: Monitoring settings
de: Überwachung Einstellungen

# apps_title
source: Apps
de: Anwendungen

# apps_watched_apps_title
source: Watched applications
de: Überwachte Anwendungen

source: Config loaded.
de: Konfig geladen.

source: Config not saved.
de: Konfig nicht gespeichert.

# config_not_saved_changes
source: There are unsaved settings, what do you want to do?
de: Es gibt ungespeicherte Änderungen. Was möchtest du tun?

source: Config saved.
de: Konfig gespeichert.

# config_saving_failed
source: Saving failed
de: Speichern fehlgeschlagen

source: Delete
de: Löschen

source: Discard
de: Verwerfen

# error_service_timeout_text
source: The Watchdog service is not responding. (timeout)
de: Der Watchdog-Dienst antwortet nicht rechtzeitig. (Timeout)

# error_service_notavailable_text
source: The watchdog service is not running or cannot be reached.
de: Der Watchdog-Dienst läuft nicht oder ist nicht erreichbar.

# logs_error_while_loading
source: Error while loading the log.
de: Fehler beim Laden des Logs.

# logs_last_update_text
source: Log from {0} - last update {1}
de: Log vom {0} - letzte Aktualisierung {1}

# logs_loaded_text
source: Logs loaded ({0})
de: Logs geladen ({0})

source: Logs loading...
de: Logs werden geladen ...

# logs_load_day
source: Load Day
de: Tag laden

# logs_no_logs_found
source: No logs found.
de: Keine Logs vorhanden.

# logs_open_folder
source: Open logs folder
de: Logs Ordner öffnen

# logs_search_matches
source: {0} matches
de: {0} Treffer

# logs_search_placeholder
source: Search logs ...
de: Logs durchsuchen ...

source: No
de: Nein

# notifications_description
source: Configure notification channels for AppWatchdog. SMTP is used for email notifications, NTFY for push notifications.
de: Hier konfigurieren Sie die Benachrichtigungswege des AppWatchdog. SMTP eignet sich für klassische Status-E-Mails, NTFY für schnelle Push-Benachrichtigungen.

# notifications_header
source: Notifications
de: Benachrichtigungen

# notifications_title
source: Notifications
de: Benachrichtigungen

# notific_ntfy_enabled
source: Enabled
de: Aktiviert

# notific_ntfy_priority
source: Priority (1–5)
de: Priorität (1–5)

# notific_ntfy_successful
source: NTFY-Test successful
de: NTFY-Test erfolgreich

# notific_ntfy_test_failed
source: NTFY-Test failed
de: NTFY-Test fehlgeschlagen

# notific_ntfy_test_success_finish
source: NTFY-Test successfully finished.
de: NTFY-Test erfolgreich abgeschlossen.

# notific_smtp_from
source: Sender (From)
de: Absender (From)

# notific_smtp_password
source: SMTP password
de: SMTP-Passwort

# notific_smtp_ssl
source: Enable SSL
de: SSL aktiv

# notific_smtp_test_failed
source: SMTP-Test failed
de: SMTP-Test fehlgeschlagen

# notific_smtp_test_success
source: SMTP-Test successful
de: SMTP-Test erfolgreich

# notific_smtp_test_success_finish
source: SMTP-Test successfully completed.
de: SMTP-Test erfolgreich abgeschlossen.

# notific_smtp_to
source: Recipient (To)
de: Empfänger (To)

# notific_smtp_user
source: User
de: Benutzer

# pipe_not_available_ex
source: Pipe is not available ({0})
de: Pipe nicht erreichbar ({0})

source: Save
de: Speichern

# service_active_apps_title
source: Active applications
de: Aktive Anwendungen

# service_app_active
source: Active: {0}
de: Aktiv: {0}

# service_button_install
source: Install
de: Installieren

# service_button_start
source: Start
de: Starten

# service_button_stop
source: Stop
de: Stoppen

# service_button_uninstall
source: Uninstall
de: Deinstallieren

# service_button_reinstall
source: Reinstall
de: Neu installieren

source: Service connected
de: Service verbunden

# service_description
source: Status, system information and currently monitored applications of the AppWatchdog service.
de: Status, Systeminformationen und aktuell überwachte Anwendungen des AppWatchdog-Dienstes.

source: Service error
de: Service-Fehler

# service_machine_name
source: Machine name:
de: Rechnername:

# service_memory
source: Memory:
de: Arbeitsspeicher:

# service_no_active_apps
source: No active applications.
de: Keine aktiven Anwendungen.

# service_os
source: Operating system:
de: Betriebssystem:

source: Service stopped
de: Service ist gestopped

# service_succesfully_installed
source: Service successfully installed
de: Erfolgreich Dienst installiert

# service_succesfully_started
source: Service successfully started
de: Erfolgreich Dienst gestartet

# service_succesfully_stopped
source: Service successfully stopped
de: Erfolgreich Dienst gestoppt

# service_succesfully_uninstalled
source: Service successfully uninstalled
de: Erfolgreich Dienst deinstalliert

# service_systeminfo_title
source: System information
de: Systeminformationen

# service_system_info_memory
source: {0} MB free / {1} MB total
de: {0} MB frei / {1} MB gesamt

# warn
source: Warning!
de: Warnung!

source: Yes
de: Ja

# error_service_notavailable
source: Service not available
de: Dienst nicht erreichbar

# error_service_invalid_state
source: Invalid state
de: Ungültiger Zustand

# error_service_unexpected_error
source: Unexpected error
de: Unerwarteter Fehler

# error_service_dialog_showdetails
source: Show details
de: Details anzeigen

source: Language
de: Sprache

# error_service_update_required
source: Service update required
de: Dienst Update nötig

# error_service_update_required_text
source: Your service is outdated and needs an update,\ndo you want to proceed with the update?
de: Der Windows Dienst benötigt ein Update,\nmöchtest du mit dem Vorgang fortfahren?

source: Close
de: Schließen

# error_service_not_installed_title
source: Service not installed
de: Dienst nicht installiert

# error_service_not_installed_text
source: The Watchdog service is not installed.\nDo you want to install it now?
de: Der Watchdog-Dienst ist nicht installiert.\nSoll er jetzt installiert werden?

# error_service_not_running_title
source: Service is stopped
de: Dienst ist gestoppt

# error_service_not_running_text
source: The Watchdog service is installed but not running. Do you want to start it now?
de: Der Watchdog-Dienst ist installiert, aber nicht gestartet. Soll er jetzt gestartet werden?

source: Install
de: Installieren

source: Reinstall
de: Neu installieren

source: Start
de: Starten

# service_action_in_progress
source: Performing action ...
de: Aktion wird durchgeführt ...

# service_action_success_title
source: Success
de: Erfolgreich

# service_action_success_text
source: The action was completed successfully.
de: Die Aktion wurde erfolgreich ausgeführt.

# error_service_action_failed_title
source: Action failed
de: Aktion fehlgeschlagen

# error_uac_cancelled_title
source: Administrator privileges required
de: Administratorrechte erforderlich

# error_uac_cancelled_text
source: The action was cancelled or the UAC prompt was not confirmed.
de: Die Aktion wurde abgebrochen oder der UAC-Dialog wurde nicht bestätigt.

# error_service_action_failed_text
source: The service action could not be completed.
de: Die Service-Aktion konnte nicht ausgeführt werden.

source: Cancel
de: Abbrechen

# notific_discord_username
source: Displayname
de: Anzeigename

# notific_discord_test
source: Test Discord
de: Discord testen

# notific_discord_test_success
source: Discord test successful
de: Discord Test erfolgreich

# notific_telegram_test
source: Test Telegram
de: Telegram testen

# notific_telegram_test_success
source: Telegram test successful
de: Telegram Test erfolgreich

# notific_enabled
source: Enabled
de: Aktiviert

# jobs_live_title
source: Jobs running
de: Jobs in Ausführung

# jobs_live_description
source: Here you can see all currently running jobs in the service.
de: Hier kannst du alle aktuellen Jobs sehen welche im Dienst ausgeführt werden.

# UP
source: ON
de: AN

source: DOWN
de: Aus

source: unknown
de: Unbekannt

# RECOVERY_FAILED
source: Restart failed
de: Neustart fehlgeschlagen

source: Config
de: Konfig

# language_changed
source: Changed successfully
de: Erfolgreich geändert

# apps_interval_hint_http
source: HTTP: recommended ≥ 30 seconds (min. 15s)
de: HTTP: empfohlen ≥ 30 Sekunden (mind. 15s)

# apps_interval_hint_tcp
source: TCP: recommended ≥ 15 seconds (min. 15s)
de: TCP: empfohlen ≥ 15 Sekunden (mind. 15s)

# apps_interval_hint_executable
source: Application: typically 5–10 seconds
de: Anwendung: 5–10 Sekunden üblich

# apps_interval_hint_service
source: Service: typically 5–10 seconds
de: Service: 5–10 Sekunden üblich

# service_status_title
source: Service status
de: Serviceinformationen

# service_snapshot_time
source: Snapshot time
de: Snapshot Zeit

source: Service session
de: Dienst Benutzer

# service_apps_summary
source: Healthcheck Jobs
de: Job Anwendungen

# backup_plans_title
source: Backup Plans
de: Sicherungspläne

# backup_description
source: Create and manage backup plans for your data
de: Erstellen und verwalten Sie Sicherungspläne für Ihre Daten

# backup_plans_select
source: Select a plan to edit
de: Wählen Sie einen Plan zum Bearbeiten

# backup_add
source: Add
de: Hinzufügen

# backup_remove
source: Remove
de: Entfernen

# backup_reload
source: Reload
de: Neu laden

# backup_save
source: Save
de: Speichern

# backup_run_now
source: Run Now
de: Jetzt ausführen

# backup_general
source: General
de: Allgemein

# backup_general_desc
source: Basic plan name and backup mode
de: Grundlegender Plan-Name und Sicherungsmodus

# backup_enabled
source: Enabled
de: Aktiviert

# backup_mode
source: Mode
de: Modus

# backup_schedule
source: Schedule
de: Zeitplan

# backup_schedule_desc
source: Define when and how often backups run
de: Legen Sie fest, wann und wie oft Sicherungen ausgeführt werden

# backup_daily_time
source: Daily execution time
de: Tägliche Ausführungszeit

# backup_daily_time_desc
source: Set the time when backups will run each day
de: Legen Sie die Zeit fest, zu der Sicherungen täglich ausgeführt werden

# backup_hour
source: Hour (0-23)
de: Stunde (0-23)

# backup_run_days
source: Run on days
de: An welchen Tagen ausführen

# backup_run_days_desc
source: Select which days of the week the backup should run
de: Wählen Sie aus, an welchen Wochentagen die Sicherung ausgeführt werden soll

# backup_source
source: Source
de: Quelle

# backup_source_desc
source: What to back up: folder, file, or SQL database
de: Was gesichert werden soll: Ordner, Datei oder SQL-Datenbank

# backup_source_type
source: Source Type
de: Quellentyp

# backup_folder
source: Folder
de: Ordner

# backup_file
source: File
de: Datei

# backup_sql_connection
source: SQL Connection String
de: SQL-Verbindungszeichenfolge

# backup_database
source: Database
de: Datenbank

# backup_target
source: Target
de: Ziel

# backup_target_desc
source: Where to store backups: local or SFTP
de: Wo Sicherungen gespeichert werden: lokal oder SFTP

# backup_target_type
source: Target Type
de: Zieltyp

# backup_local_directory
source: Local Directory
de: Lokales Verzeichnis

# backup_user
source: User
de: Benutzer

# backup_password
source: Password
de: Passwort

# backup_remote_directory
source: Remote Directory
de: Remote-Verzeichnis

# backup_host_key
source: Host Key Fingerprint
de: SSH-Schlüssel-Fingerprint

# backup_compression
source: Compression
de: Komprimierung

# backup_compression_desc
source: Reduce backup size with compression
de: Reduzieren Sie die Sicherungsgröße durch Komprimierung

# backup_compression_enable
source: Enable compression
de: Komprimierung aktivieren

# backup_compression_level
source: Level (1-9)
de: Stufe (1-9)

# backup_compression_hint
source: Higher level = better compression but slower
de: Höhere Stufe = bessere Komprimierung, aber langsamer

# backup_encryption
source: Encryption
de: Verschlüsselung

# backup_encryption_desc
source: Protect backups with password encryption
de: Schützen Sie Sicherungen mit Passwortverschlüsselung

# backup_encryption_enable
source: Enable encryption
de: Verschlüsselung aktivieren

# backup_iterations
source: Iterations
de: Iterationen

# backup_iterations_hint
source: Higher values are more secure but slower (typical: 100,000 - 500,000)
de: Höhere Werte sind sicherer, aber langsamer (typisch: 100.000 - 500.000)

# backup_retention
source: Retention
de: Aufbewahrung

# backup_retention_desc
source: Automatically delete old backups
de: Automatisches Löschen alter Sicherungen

# backup_keep_last
source: Keep last backups
de: Behalte letzte Sicherungen

# backup_keep_last_hint
source: Number of recent backups to keep (older ones are automatically deleted)
de: Anzahl der letzten Sicherungen, die behalten werden (ältere werden automatisch gelöscht)

# apps_target_type
source: Target type
de: Zieltyp

# apps_service_name
source: Service name
de: Dienstname

# apps_url_tooltip
source: Must be a valid absolute URL (http/https)
de: Muss eine gültige absolute URL sein (http/https)

# apps_expected_http_status
source: Expected HTTP status code
de: Erwarteter HTTP-Statuscode

# jobs_rebuild
source: Rebuild jobs
de: Jobs neu aufbauen

# jobs_stats
source: Stats
de: Statistiken

# jobs_source_label
source: Source:
de: Quelle:

# jobs_target_label
source: Target:
de: Ziel:

# jobs_from_label
source: From:
de: Von:

# logs_description
source: View and search service logs in real-time
de: Service-Logs in Echtzeit ansehen und durchsuchen

# logs_refresh
source: Refresh logs
de: Logs aktualisieren

# logs_available_title
source: Available logs
de: Verfügbare Logs

# logs_available_hint
source: Click to load log
de: Zum Laden anklicken

# logs_search_title
source: Search logs
de: Logs durchsuchen

# logs_search_hint
source: Find text in logs
de: Text in Logs finden

# logs_content_title
source: Log content
de: Log-Inhalt

# restore_title
source: Restore backup
de: Backup wiederherstellen

# restore_description
source: Recover your data from backup artifacts
de: Daten aus Backup-Artefakten wiederherstellen

# restore_reload_plans
source: Reload plans
de: Pläne neu laden

# restore_browse_folder
source: Browse folder
de: Ordner auswählen

# restore_start
source: Start restore
de: Wiederherstellung starten

# restore_plans_hint
source: Select a plan to restore from
de: Plan zum Wiederherstellen auswählen

# restore_artifacts_title
source: Backup artifacts
de: Backup-Artefakte

# restore_artifacts_hint
source: Choose a backup artifact to restore
de: Backup-Artefakt zum Wiederherstellen wählen

# restore_configuration_title
source: Configuration
de: Konfiguration

# restore_blocked_title
source: Restore blocked
de: Wiederherstellung blockiert

# restore_details_title
source: Restore details
de: Wiederherstellungsdetails

# restore_location_title
source: Restore location
de: Zielordner

# restore_overwrite_toggle
source: Overwrite existing files
de: Vorhandene Dateien überschreiben

# restore_files_title
source: Files to restore
de: Dateien zur Wiederherstellung

# restore_files_hint
source: Select which files to restore
de: Dateien auswählen, die wiederhergestellt werden sollen

# restore_select_all
source: Select all
de: Alle auswählen

# restore_select_none
source: Select none
de: Keine auswählen

# backup_day_mon
source: Mon
de: Mo

# backup_day_tue
source: Tue
de: Di

# backup_day_wed
source: Wed
de: Mi

# backup_day_thu
source: Thu
de: Do

# backup_day_fri
source: Fri
de: Fr

# backup_day_sat
source: Sat
de: Sa

# backup_day_sun
source: Sun
de: So
